tg-bot/ШаблонБота/src/Catalogs/НеобработанноеВходящееСообщениеТелеграм/НеобработанноеВходящееСообщениеТелеграм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НеобработанноеВходящееСообщениеТелеграм</name>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

tg-bot/ШаблонБота/src/HTTPServices/ИнтеграцияТелеграм/Module.bsl
Функция PingЛюбой(Запрос)
	Возврат HTTPСервисы.СформироватьHTTPОтвет(200, "ok",);
КонецФункции

Функция sendPOST(Запрос)
	
	Попытка
		
		ЗаписатьНеобработанноеСообщение(Запрос);
				
		Токен 			= Запрос.ПараметрыURL["token"];
		ДанныеЗапроса 	= HTTPСервисы.ЗначениеИзТелаJSON(Запрос);

		Возврат Телеграм.ОбработатьЗапрос(Токен, ДанныеЗапроса);
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации("tg-api.sendPOST", УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		Возврат HTTPСервисы.СообщениеОбОшибке(500, НСтр("ru = 'Внутренняя ошибка сервера'"),
			ТекстОшибки,, ТекстОшибки);
			
	КонецПопытки;
	
КонецФункции

Процедура ЗаписатьНеобработанноеСообщение(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НеобработанноеСообщение = Справочники.НеобработанноеВходящееСообщениеТелеграм.СоздатьЭлемент();
	НеобработанноеСообщение.ДатаПоступления = ТекущаяУниверсальнаяДата();
	
	ЛогЗапроса = Новый Массив;
	ЛогЗапроса.Добавить(Запрос.HTTPМетод);
	ЛогЗапроса.Добавить(Запрос.ОтносительныйURL);
	ЛогЗапроса.Добавить(Запрос.ПолучитьТелоКакСтроку());
		
	ТекстЗапроса = СтрСоединить(ЛогЗапроса, Символы.ПС); 
	
	НеобработанноеСообщение.ТекстЗапроса = ТекстЗапроса;	
	
	НеобработанноеСообщение.Записать();	
	
КонецПроцедуры
